<?php
/*
|--------------------------------------------------------------------------
| JWT权限控制配置文件
|--------------------------------------------------------------------------
| 定义JWT权限控制配置信息
|
*/

return [
    // 默认权限配置标识
    'default' => 'admin',
    // 权限配置列表
    'configs' => [
        'admin' => [
            // 加密key
            'key'       => '%s',
            // 加密算法
            'alg'       => 'HS256',
            // 签发单位
            'iss'       => 'Gaia-Admin-Auth',
            // 签发主题
            'sub'       => 'Admin-User-Auth',
            // 生效时间，签发时间 + nbf
            'nbf'       => 0,
            // 有效时间，生效时间 + exp
            'exp'       => 7200,
        ]
    ]
];
